# WrongConstraintInSkeletonSketch Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..WrongConstraintInSkeletonSketch Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Reference Lines can only be constrained to Reference Planes, Levels, Family Host, and other Reference Lines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WrongConstraintInSkeletonSketch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WrongConstraintInSkeletonSketch As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WrongConstraintInSkeletonSketch {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace